#!/bin/bash

# اجرای کلاینت‌های وارپ برای لوکیشن‌های مختلف به صورت پروسس پس‌زمینه
# آلمان (پورت 40001)
nohup /usr/local/bin/warp-plus -b 127.0.0.1:40001 -e 162.159.192.1:2408 > /dev/null 2>&1 &

# هلند (پورت 40002)
nohup /usr/local/bin/warp-plus -b 127.0.0.1:40002 -e 162.159.193.10:2408 > /dev/null 2>&1 &

# آمریکا (پورت 40003)
nohup /usr/local/bin/warp-plus -b 127.0.0.1:40003 -e 162.159.195.1:2408 > /dev/null 2>&1 &

# مکث کوتاه برای بالا آمدن پورت‌ها
sleep 2

# اجرای هسته اصلی پنل
exec /app/x-ui
